Repository: thomasben3/portfolio-flutter
Catalog: lib/l10n/app_*.arb
Languages: fr

# language
source: English
fr: Français

source: Developer
fr: Développeur

source: Skills
fr: Compétences

source: Continuous learning
fr: Apprentissage continu

# learningQuote
source: One of the first things I learned about computing is that you never stop learning.
fr: Une des premières choses que j'ai appris à propos de l'informatique, c'est qu'il ne faut jamais arrêter d'apprendre.

source: Projects
fr: Projets

# projectsOf42
source: At 42 school based Paris, I worked on a variety of projects. Here are a few examples.
fr: À l'école 42, située à Paris, j'ai réalisé des projets variés. En voici quelques exemples.

# cub3dQuote
source: This project, which I completed in 2022, is a ray-casting engine built entirely in C.
fr: Ce projet réalisé en 2022 est un moteur de ray-casting entièrement réalisé en C.

# transcendenceQuote
source: Final project for the 42 core curriculum. Carried out in groups, this is a web application for an online pong game.
fr: Projet final du tronc commun de 42. Effectué en groupe, il s'agit d'une application web de jeu pong en ligne.

source: Professional project.
fr: Projet professionel.

# isocleanQuote
source: This is my first project as a freelancer. From 2023, my mission has been to develop an internal cross-platform application for the window cleaning company Isoclean, which currently has over 10,000 customers with 3 subsidiaries. The aim of this application was to produce estimates automatically and then generate contracts that are synchronised via the existing CRM API. Today, the application generates an average of 400 contracts per month. It also enables the technical teams to manage their appointments with a single click when they arrive at the customer's premises, and for the customer to sign off on the application when they leave.
fr: Il s'agit de mon premier projet en tant qu'auto-entrepreneur. À partir de 2023, ma mission à été de développer une application cross-platform interne pour l'entreprise de lavage de vitres Isoclean, qui compte à ce jour plus de 10000 clients avec 3 filliales. Cette application à pour but de faire des devis automatiquement puis de generer des contrats qui seront synchronisés via l'API du CRM déjà existant. Aujourd'hui l'application génère en moyenne 400 contrats par mois. Elle permet également aux équipes techniques de pouvoir gérer leur rendez vous d'un simple clic lors de l'arrivée chez le client et d'une signature de ce dernier sur l'application au moment de partir.

# portfolioMadeWithFlutter
source: This portfolio was made with Flutter, you can find the source code here:
fr: Ce portfolio à été réalisé avec Flutter, vous pouvez retrouver le code source juste ici :

# languageSetting
source: Language
fr: Langue

source: Theme
fr: Thème

source: Show CV
fr: Voir le CV
